In [25]:
import pandas as pd

df = pd.read_csv('customer_data.csv')
print(df.head)

<bound method NDFrame.head of     CustomerID     Name  Age                Email
0            1    Alice   25    alice@example.com
1            2      Bob   30      bob@example.com
2            3  Charlie   28  charlie@example.com
3            4    David   35    david@example.com
4            5      Eva   22      eva@example.com
5            6    Frank   31    frank@example.com
6            7    Grace   27    grace@example.com
7            8   Hannah   29   hannah@example.com
8            9      Ian   33      ian@example.com
9           10    Jenny   24    jenny@example.com
10          11    Kevin   32    kevin@example.com
11          12     Lisa   26     lisa@example.com
12          13  Michael   36  michael@example.com
13          14     Nina   23     nina@example.com
14          15     Owen   34     owen@example.com>

In [26]:
print("First few rows of the DataFrame:")
print(df.head())

First few rows of the DataFrame:
   CustomerID     Name  Age                Email
0           1    Alice   25    alice@example.com
1           2      Bob   30      bob@example.com
2           3  Charlie   28  charlie@example.com
3           4    David   35    david@example.com
4           5      Eva   22      eva@example.com

In [27]:
print("\nLast few rows of the DataFrame:")
df.tail()

Last few rows of the DataFrame:

    CustomerID     Name  Age                Email
10          11    Kevin   32    kevin@example.com
11          12     Lisa   26     lisa@example.com
12          13  Michael   36  michael@example.com
13          14     Nina   23     nina@example.com
14          15     Owen   34     owen@example.com

In [28]:
df = pd.read_csv('customer_data.csv')
df.head()

   CustomerID     Name  Age                Email
0           1    Alice   25    alice@example.com
1           2      Bob   30      bob@example.com
2           3  Charlie   28  charlie@example.com
3           4    David   35    david@example.com
4           5      Eva   22      eva@example.com

In [29]:
print("\nLast few rows of the DataFrame:")
df.tail(7)  #we can tell how much data has to be printed

Last few rows of the DataFrame:

    CustomerID     Name  Age                Email
8            9      Ian   33      ian@example.com
9           10    Jenny   24    jenny@example.com
10          11    Kevin   32    kevin@example.com
11          12     Lisa   26     lisa@example.com
12          13  Michael   36  michael@example.com
13          14     Nina   23     nina@example.com
14          15     Owen   34     owen@example.com

In [30]:
# Data Types
df.dtypes

CustomerID     int64
Name          object
Age            int64
Email         object
dtype: object

In [32]:
print("\nsummary of the DataFrame:")
df.info()

summary of the DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  15 non-null     int64
 1   Name        15 non-null     object
 2   Age         15 non-null     int64
 3   Email       15 non-null     object
dtypes: int64(2), object(2)
memory usage: 612.0+ bytes

In [33]:
print("\nBasic statistics of numerical columns:")
df.describe()

Basic statistics of numerical columns:

       CustomerID        Age
count   15.000000  15.000000
mean     8.000000  29.000000
std      4.472136   4.472136
min      1.000000  22.000000
25%      4.500000  25.500000
50%      8.000000  29.000000
75%     11.500000  32.500000
max     15.000000  36.000000

In [34]:
# ummary statics
df.describe(include='all')

        CustomerID   Name        Age              Email
count    15.000000     15  15.000000                 15
unique         NaN     15        NaN                 15
top            NaN  Alice        NaN  alice@example.com
freq           NaN      1        NaN                  1
mean      8.000000    NaN  29.000000                NaN
std       4.472136    NaN   4.472136                NaN
min       1.000000    NaN  22.000000                NaN
25%       4.500000    NaN  25.500000                NaN
50%       8.000000    NaN  29.000000                NaN
75%      11.500000    NaN  32.500000                NaN
max      15.000000    NaN  36.000000                NaN

In [38]:
# Checking for missing values 

print("\nMissing values in each column:")
df.isnull().sum()

Missing values in each column:

CustomerID    0
Name          0
Age           0
Email         0
dtype: int64

In [40]:
# Get unique values for categorial columns

print("\nUnique values in 'Name' column:")

df['Name'].unique()

Unique values in 'Gender' column:

array(['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace',
       'Hannah', 'Ian', 'Jenny', 'Kevin', 'Lisa', 'Michael', 'Nina',
       'Owen'], dtype=object)

In [42]:
print("\nUnique values in 'Age' column:")

print(df['Age'].unique()) #using print

Unique values in 'Age' column:
[25 30 28 35 22 31 27 29 33 24 32 26 36 23 34]

In [43]:
# Get the count of unique values for categorical columns

print("\nCount of unique calues in 'Agge' column:")
print(df['Age'].value_counts())

Count of unique calues in 'Agge' column:
Age
25    1
30    1
28    1
35    1
22    1
31    1
27    1
29    1
33    1
24    1
32    1
26    1
36    1
23    1
34    1
Name: count, dtype: int64

In [44]:
# Checking for duplicate rows

print("\nDuplicate rows in the DataFrame:")
print(df.duplicated().sum())

Duplicate rows in the DataFrame:
0